---
type: ExtElemChangeBeamSectionRegistry
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 4
tags: [revit-api, class]
---

# ExtElemChangeBeamSectionRegistry

`Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `` |
| Method | RegisterInterface | 2018 | `public static void RegisterInterface ( IExtElemChangeBeamSection provider )` |
| Method | Unregister | 2018 | `public static void Unregister ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |